#!/bin/bash
# Задача 1:
# Напишете командна процедура на bash, приемаща от командния си ред три аргумента. Трите аргумента са цели числа съответстващи 
# на число и краища на числов интервал. 
# Скрипта да проверява дали числото е в указания интервал и да извежда подходящо съобщение спрямо случая, в който попада.
# При неуспех командната процедура да връща код на изход 99.

if [ $# -ne 3 ]
then echo 99
else
    if [ $1 -ge $2 -a $3 -ge $1 ]
    then
        echo "$1 is in [$2, $3]"
    else
        echo "$1 is NOT in [$2, $3]"
    fi   
fi

