% решете символно задачата (това не е задача на Коши)
% (1-x^2)*D2y-2*x*Dy+n*(n+1)*y = 0
% y(-1) = (-1)^n, y(1) = 1
% за n = 0, 1, 2
% Начертайте графиките на решенията в интервала [-1, 1]
function ex7zad1 % legendrepoly
clc;
p0 = dsolve('(1-x^2)*D2y-2*x*Dy = 0', 'y(-1)=1', 'y(1)=1', 'x')
p1 = dsolve('(1-x^2)*D2y-2*x*Dy+2*y = 0', 'y(-1)=-1', 'y(1)=1', 'x')
p2 = dsolve('(1-x^2)*D2y-2*x*Dy+6*y = 0', 'y(-1)=1', 'y(1)=1', 'x')

x = -1:0.01:1;
plot(x, eval(p0)*ones(length(x)), x, eval(p1), x, eval(p2));
axis([-1, 1, -1, 1.2]);

end